gdb ./a.out 
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from ./a.out...done.
(gdb) b input
Function "input" not defined.
Make breakpoint pending on future shared library load? (y or [n]) y
Breakpoint 1 (input) pending.
(gdb) q
îº§ gdb ./a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from ./a.out...done.
(gdb) b input_two_string
Breakpoint 1 at 0x77a: file p6final.c, line 4.
(gdb) r
Starting program: /home/runner/pps-IA1-practice/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, input_two_string (a=0x7ffd62ca6420 "\001", 
    b=0x7ffd62ca6440 "\300\t`\203\371U") at p6final.c:4
4       printf("Enter any word:\n");
(gdb) n
Enter any word:
5       scanf("%s",a);
(gdb) n
PAVAN
6       printf("Enter any word:\n");
(gdb) n
Enter any word:
7       scanf("%s",b);
(gdb) n
sujay
8   }
(gdb) n
main () at p6final.c:62
62      ans=cmp(a,b);
(gdb) n
63      output(a,b,ans);
(gdb) n
sujay is greater than PAVAN
64      return 0;
(gdb) n
65  }
(gdb) q